In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("temperatures.csv" , index_col=0)
df

             date     city        country  avg_temp_c
0      2000-01-01  Abidjan  Côte D'Ivoire      27.293
1      2000-02-01  Abidjan  Côte D'Ivoire      27.685
2      2000-03-01  Abidjan  Côte D'Ivoire      29.061
3      2000-04-01  Abidjan  Côte D'Ivoire      28.162
4      2000-05-01  Abidjan  Côte D'Ivoire      27.547
...           ...      ...            ...         ...
16495  2013-05-01     Xian          China      18.979
16496  2013-06-01     Xian          China      23.522
16497  2013-07-01     Xian          China      25.251
16498  2013-08-01     Xian          China      24.528
16499  2013-09-01     Xian          China         NaN

[16500 rows x 4 columns]

In [3]:
df.describe()

         avg_temp_c
count  16407.000000
mean      19.732877
std        9.579635
min      -23.495000
25%       14.870000
50%       22.119000
75%       27.001500
max       38.283000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16500 entries, 0 to 16499
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        16500 non-null  object
 1   city        16500 non-null  object
 2   country     16500 non-null  object
 3   avg_temp_c  16407 non-null  float64
dtypes: float64(1), object(3)
memory usage: 644.5+ KB

In [5]:
avg_temp = df[df["country"] == "Pakistan"]
avg_temp

            date        city   country  avg_temp_c
4785  2000-01-01  Faisalabad  Pakistan      12.792
4786  2000-02-01  Faisalabad  Pakistan      14.339
4787  2000-03-01  Faisalabad  Pakistan      20.309
4788  2000-04-01  Faisalabad  Pakistan      29.072
4789  2000-05-01  Faisalabad  Pakistan      34.845
...          ...         ...       ...         ...
8575  2013-05-01      Lahore  Pakistan      33.457
8576  2013-06-01      Lahore  Pakistan      34.456
8577  2013-07-01      Lahore  Pakistan      33.279
8578  2013-08-01      Lahore  Pakistan      31.511
8579  2013-09-01      Lahore  Pakistan         NaN

[495 rows x 4 columns]

In [17]:
temp_id = df.set_index(["country" , "city"])
temp_id

                             date  avg_temp_c
country       city
Côte D'Ivoire Abidjan  2000-01-01      27.293
              Abidjan  2000-02-01      27.685
              Abidjan  2000-03-01      29.061
              Abidjan  2000-04-01      28.162
              Abidjan  2000-05-01      27.547
...                           ...         ...
China         Xian     2013-05-01      18.979
              Xian     2013-06-01      23.522
              Xian     2013-07-01      25.251
              Xian     2013-08-01      24.528
              Xian     2013-09-01         NaN

[16500 rows x 2 columns]

In [27]:
rows_to_keep = [('Brazil' , 'Rio de Janerio') , ('Pakistan' , 'Lahore')]
rows_to_keep

[('Brazil', 'Rio de Janerio'), ('Pakistan', 'Lahore')]